Revit 2024 API
ComponentRepeaterIterator Class
 A slot iterator for ComponentRepeater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class ComponentRepeaterIterator : IEnumerator<ComponentRepeaterSlot>
Visual Basic
Public Class ComponentRepeaterIterator _
	Implements IEnumerator(Of ComponentRepeaterSlot)
Visual C++
public ref class ComponentRepeaterIterator : IEnumerator<ComponentRepeaterSlot^>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ComponentRepeaterIterator
See Also
ComponentRepeaterIterator Members
Autodesk.Revit.DB Namespace